src/cf/DataProcessors/ор_УправлениеРасположениемНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_УправлениеРасположениемНоменклатуры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ор_РасположениеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_РасположениеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ор_УправлениеРасположениемНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеНастройки = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойСклад");
	Склад = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	
	УправлениеНебольшойФирмойКлиентСервер.ИзменитьЭлементОтбораСписка(
		Ячейки,
		"Владелец",
		Склад,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);
	
	// ПодключаемоеОборудование
	ПараметрыСобытийПО = Новый Структура;
	ПараметрыСобытийПО.Вставить("ЗапретПоискаХарактеристикПоШКПроизводителя");
	РаботаСоШтрихкодамиПереопределяемый.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		РаботаСоШтрихкодамиКлиентПереопределяемый.ВнешнееСобытиеОборудования(ЭтотОбъект, Источник, Событие, Данные);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Ячейки,
		"Владелец",
		Склад,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"Ячейка",
		Элементы.Ячейки.ТекущаяСтрока,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкиПриАктивизацииСтроки(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"Ячейка",
		Элементы.Ячейки.ТекущаяСтрока,
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьНоменклатурой(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ЗаполнитьНоменклатуройЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.ор_УправлениеРасположениемНоменклатуры.Форма.ФормаВыбораНоменклатуры", ПараметрыОткрытия, ЭтаФорма,,,,ОбработчикОповещения,Режим);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкоду(Штрихкод, ДополнительныеПараметры) Экспорт
		
	Если НЕ ПустаяСтрока(Штрихкод) Тогда
		СтруктураПараметровКлиента = ПолученШтрихкодИзСШК(Штрихкод);
		ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораДанныхПоиска(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьДанныеПоКодуКлиент(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолученШтрихкодИзСШК(Штрихкод) Экспорт
	
	СтруктураРезультат = ДанныеПоискаПоШтрихкодуСервер(Штрихкод);
	Возврат СтруктураРезультат;
	
КонецФункции

&НаСервере
Функция ДанныеПоискаПоШтрихкодуСервер(Штрихкод)
	
	ФильтрПоискаПоШтрихкоду = Новый Структура;
	ФильтрПоискаПоШтрихкоду.Вставить("Номенклатура");
	
	ДанныеШтрихкода = Новый Структура;
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, ЭтотОбъект, ДанныеШтрихкода);
	Возврат ДанныеШтрихкода;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента) Экспорт
	
	ОткрытаБлокирующаяФорма = Ложь;
	РаботаСоШтрихкодамиКлиентПереопределяемый.ОбработатьДанныеПоКоду(ЭтотОбъект, СтруктураПараметровКлиента, ОткрытаБлокирующаяФорма);
	
	МассивПоиска = СтруктураПараметровКлиента.ЗначенияПоиска;
	Если МассивПоиска.Количество() = 1 Тогда
		СтрокаРезультата = МассивПоиска[0];
		Если СтрокаРезультата.ТипОбъекта = Тип("СправочникСсылка.Номенклатура")
			Или СтрокаРезультата.ТипОбъекта = "Номенклатура" Тогда
			ДобавитьНайденныеПозицииТоваровСервер(СтрокаРезультата);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ОткрытаБлокирующаяФорма Тогда
		ЗавершитьОбработкуДанныхПоКодуКлиент(СтруктураПараметровКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНайденныеПозицииТоваровСервер(СтруктураПараметров)
		
	ТекЯчейка = Элементы.Ячейки.ТекущаяСтрока;
	
	Если ТекЯчейка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ор_РасположениеНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ячейка         = ТекЯчейка;
	МенеджерЗаписи.Номенклатура   = СтруктураПараметров.Владелец;
	МенеджерЗаписи.Характеристика = СтруктураПараметров.Характеристика;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуройЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("ДанныеФормыКоллекция") Тогда
		Ячейка = Элементы.Ячейки.ТекущиеДанные.Ссылка;
		ЗаписатьРасположениеПоТаблицеНоменклатуры(Результат, Ячейка);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРасположениеПоТаблицеНоменклатуры(ТаблицаНоменклатуры, Ячейка)
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Для Каждого ТекСтрока Из ТаблицаНоменклатуры Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ор_РасположениеНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Номенклатура = ТекСтрока.Номенклатура;
		МенеджерЗаписи.Характеристика = Характеристика;
		МенеджерЗаписи.Ячейка = Ячейка;
		
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбработкуДанныхПоКодуКлиент(СтруктураПараметров)
	
	Если СтруктураПараметров.Свойство("АктивизироватьСтроку") Тогда
		
		Элементы.Список.ТекущаяСтрока = СтруктураПараметров.АктивизироватьСтроку;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
